Repository: Znbmels/keyboard
Catalog: Keyboard/*.lproj/Localizable.strings
Languages: ar, kk, ru

# app_name
source: Muslim AI Keyboard
ar: لوحة المفاتيح الإسلامية الذكية
kk: Мұсылман AI Пернетақта
ru: Мусульманская ИИ Клавиатура

# language_selection_title
source: Choose Your Language
ar: اختر لغتك
kk: Тіліңізді таңдаңыз
ru: Выберите язык

# language_selection_subtitle
source: Select your preferred language
ar: حدد لغتك المفضلة
kk: Қалаған тіліңізді таңдаңыз
ru: Выберите предпочитаемый язык

# language_continue
source: Continue
ar: متابعة
kk: Жалғастыру
ru: Продолжить

# onboarding_page1_title
source: Welcome to Muslim AI Keyboard
ar: مرحباً بك في لوحة المفاتيح الإسلامية الذكية
kk: Мұсылман AI Пернетақтасына қош келдіңіз
ru: Добро пожаловать в Мусульманскую ИИ Клавиатуру

# onboarding_page1_description
source: This app helps you write Muslim phrases faster and correctly.
ar: يساعدك هذا التطبيق على كتابة العبارات الإسلامية بسرعة وصحة.
kk: Бұл қолданба мұсылман сөздерін жылдам және дұрыс жазуға көмектеседі.
ru: Это приложение поможет вам быстро и правильно писать мусульманские фразы.

# onboarding_page2_title
source: AI-Powered Writing
ar: الكتابة بالذكاء الاصطناعي
kk: AI-қуатты жазу
ru: Письмо с ИИ

# onboarding_page2_description
source: You can use AI-powered keyboard with duas and Islamic expressions.
ar: يمكنك استخدام لوحة المفاتيح المدعومة بالذكاء الاصطناعي مع الأدعية والتعبيرات الإسلامية.
kk: Дұғалар мен ислами өрнектермен AI-қуатты пернетақтаны пайдалана аласыз.
ru: Вы можете использовать клавиатуру с ИИ для дуа и исламских выражений.

# onboarding_page3_title
source: Ready to Start
ar: جاهز للبدء
kk: Бастауға дайын
ru: Готово к использованию

# onboarding_page3_description
source: Just add the keyboard in settings and you're ready!
ar: فقط أضف لوحة المفاتيح في الإعدادات وأنت جاهز!
kk: Параметрлерде пернетақтаны қосыңыз және дайынсыз!
ru: Просто добавьте клавиатуру в настройках и вы готовы!

# button_add_keyboard
source: Add Keyboard
ar: إضافة لوحة المفاتيح
kk: Пернетақтаны қосу
ru: Добавить клавиатуру

# button_get_started
source: Get Started
ar: البدء
kk: Бастау
ru: Начать

# button_next
source: Next
ar: التالي
kk: Келесі
ru: Далее

# button_done
source: Done
ar: تم
kk: Дайын
ru: Готово

# button_skip
source: Skip
ar: تخطي
kk: Өткізу
ru: Пропустить

# button_continue
source: Continue
ar: متابعة
kk: Жалғастыру
ru: Продолжить

source: Close
ar: إغلاق
kk: Жабу
ru: Закрыть

# tab_home
source: Home
ar: الرئيسية
kk: Басты
ru: Главная

# tab_phrases
source: Phrases
ar: العبارات
kk: Сөздер
ru: Фразы

# tab_stickers
source: Stickers
ar: الملصقات
kk: Стикерлер
ru: Стикеры

# tab_keyboard
source: Keyboard
ar: لوحة المفاتيح
kk: Пернетақта
ru: Клавиатура

# tab_settings
source: Settings
ar: الإعدادات
kk: Параметрлер
ru: Настройки

# home_welcome_title
source: Welcome to Muslim AI Keyboard
ar: مرحباً بك في لوحة المفاتيح الإسلامية الذكية
kk: Мұсылман AI Пернетақтасына қош келдіңіз
ru: Добро пожаловать в Мусульманскую ИИ Клавиатуру

# home_welcome_subtitle
source: Your intelligent Islamic typing companion
ar: رفيقك الذكي للكتابة الإسلامية
kk: Сіздің ақылды ислами теру серіктесіңіз
ru: Ваш умный исламский помощник для набора текста

# home_description
source: Write Islamic phrases, duas, and expressions with ease using our AI-powered keyboard extension.
ar: اكتب العبارات الإسلامية والأدعية والتعبيرات بسهولة باستخدام امتداد لوحة المفاتيح المدعوم بالذكاء الاصطناعي.
kk: AI-қуатты пернетақта кеңейтімін пайдаланып ислами сөздерді, дұғаларды және өрнектерді оңай жазыңыз.
ru: Пишите исламские фразы, дуа и выражения с легкостью, используя наше расширение клавиатуры с ИИ.

# home_features_title
source: Features
ar: الميزات
kk: Мүмкіндіктер
ru: Возможности

# home_feature1
source: AI-powered suggestions
ar: اقتراحات مدعومة بالذكاء الاصطناعي
kk: AI-қуатты ұсыныстар
ru: Предложения с ИИ

# home_feature2
source: Islamic phrases database
ar: العبارات الإسلامية
kk: Ислами сөздер
ru: База исламских фраз

# home_feature3
source: Multiple languages support
ar: مجموعة الأدعية
kk: Дұғалар жинағы
ru: Поддержка нескольких языков

# home_feature4
source: Easy to use interface
ar: دعم متعدد اللغات
kk: Көп тілді қолдау
ru: Простой интерфейс

# keyboard_title
source: Setup Instructions
ar: تعليمات الإعداد
kk: Орнату нұсқаулары
ru: Инструкции по настройке

# keyboard_subtitle
source: Follow these steps to add the keyboard
ar: اتبع هذه الخطوات لإضافة لوحة المفاتيح
kk: Пернетақтаны қосу үшін осы қадамдарды орындаңыз
ru: Следуйте этим шагам для добавления клавиатуры

# keyboard_step1
source: 1. Tap 'Add Keyboard' button
ar: 1. اضغط على زر 'إضافة لوحة المفاتيح'
kk: 1. 'Пернетақтаны қосу' түймесін басыңыз
ru: 1. Нажмите кнопку 'Добавить клавиатуру'

# keyboard_step2
source: 2. Go to Settings > General > Keyboard
ar: 2. انتقل إلى الإعدادات > عام > لوحة المفاتيح
kk: 2. Параметрлер > Жалпы > Пернетақта бөліміне өтіңіз
ru: 2. Перейдите в Настройки > Основные > Клавиатура

# keyboard_step3
source: 3. Tap 'Keyboards' then 'Add New Keyboard'
ar: 3. اضغط على 'لوحات المفاتيح' ثم 'إضافة لوحة مفاتيح جديدة'
kk: 3. 'Пернетақталар' содан кейін 'Жаңа пернетақта қосу' басыңыз
ru: 3. Нажмите 'Клавиатуры', затем 'Добавить клавиатуру'

# keyboard_step4
source: 4. Select 'Muslim AI Keyboard'
ar: 4. اختر 'لوحة المفاتيح الإسلامية الذكية'
kk: 4. 'Мұсылман AI Пернетақта' таңдаңыз
ru: 4. Выберите 'Мусульманская ИИ Клавиатура'

# keyboard_step5
source: 5. Enable 'Allow Full Access' for AI features
ar: 5. فعّل 'السماح بالوصول الكامل' لميزات الذكاء الاصطناعي
kk: 5. AI мүмкіндіктері үшін 'Толық қол жетімділікті рұқсат ету' қосыңыз
ru: 5. Включите 'Разрешить полный доступ' для функций ИИ

# keyboard_how_to_use
source: How to Use
ar: كيفية الاستخدام
kk: Қалай пайдалану
ru: Как использовать

# keyboard_usage_description
source: Once installed, you can switch to Muslim AI Keyboard in any app by tapping the globe icon on your keyboard.
ar: بعد التثبيت، يمكنك التبديل إلى لوحة المفاتيح الإسلامية الذكية في أي تطبيق بالضغط على أيقونة الكرة الأرضية في لوحة المفاتيح.
kk: Орнатылғаннан кейін, кез келген қолданбада пернетақтадағы глобус белгішесін басу арқылы Мұсылман AI Пернетақтасына ауыса аласыз.
ru: После установки вы можете переключиться на Мусульманскую ИИ Клавиатуру в любом приложении, нажав значок глобуса на клавиатуре.

# settings_title
source: Settings
ar: الإعدادات
kk: Параметрлер
ru: Настройки

# settings_language
source: Language
ar: اللغة
kk: Тіл
ru: Язык

# settings_change_language
source: Change Language
ar: تغيير اللغة
kk: Тілді өзгерту
ru: Изменить язык

# settings_about
source: About
ar: حول التطبيق
kk: Қосымша туралы
ru: О приложении

# settings_version
source: Version
ar: الإصدار
kk: Нұсқа
ru: Версия

# settings_support
source: Support
ar: الدعم
kk: Қолдау
ru: Поддержка

# settings_privacy
source: Privacy Policy
ar: سياسة الخصوصية
kk: Құпиялылық саясаты
ru: Политика конфиденциальности

# settings_terms
source: Terms of Service
ar: شروط الاستخدام
kk: Пайдалану шарттары
ru: Условия использования

# appearance_settings
source: Appearance
ar: المظهر
kk: Сыртқы түр
ru: Внешний вид

# keyboard_color_title
source: Keyboard Color
ar: لون لوحة المفاتيح
kk: Пернетақта түсі
ru: Цвет клавиатуры

source: Content Settings
ar: إعدادات المحتوى
kk: Мазмұн параметрлері
ru: Содержимое

source: Keyboard Settings
ar: إعدادات لوحة المفاتيح
kk: Пернетақта параметрлері
ru: Настройки клавиатуры

# select_phrases_title
source: Select Islamic Phrases
ar: اختر العبارات
kk: Сөздерді таңдау
ru: Выбрать исламские фразы

# select_duas_title
source: Select Duas for Keyboard
ar: اختر الأدعية
kk: Дұғаларды таңдау
ru: Выбрать дуа

# islamic_phrases_title
source: Islamic Phrases
ar: العبارات الإسلامية
kk: Ислами сөздер
ru: Исламские фразы

# islamic_phrases_subtitle
source: Select phrases to use in your keyboard
ar: اختر وأضف إلى لوحة المفاتيح
kk: Таңдаңыз және пернетақтаға қосыңыз
ru: Выберите фразы для использования в клавиатуре

source: Select All
ar: تحديد الكل
kk: Барлығын таңдау
ru: Выбрать все

source: Deselect All
ar: إلغاء تحديد الكل
kk: Барлығын алып тастау
ru: Снять выбор

source: selected
ru: выбрано

# phrase_assalamu_alaikum
source: Assalamu Alaikum
ru: Ассаляму 'аляйкум

# phrase_wa_alaikum_assalam
source: Wa Alaikum Assalam
ru: Уа 'аляйкум ассалям

# phrase_bismillah
source: Bismillah
ru: Бисмилляh

# phrase_alhamdulillah
source: Alhamdulillah
ru: Альхамдулиллаh

# phrase_subhanallah
source: SubhanAllah
ru: СубхьанАллаh

# phrase_allahu_akbar
source: Allahu Akbar
ru: Аллаhу Акбар

# phrase_la_ilaha_illallah
source: La ilaha illallah
ru: Ля иляха илляллах

# phrase_astaghfirullah
source: Astaghfirullah
ru: Астагфируллах

# phrase_inshallah
source: InshaAllah
ru: ИншаАллах

# phrase_mashallah
source: MashaAllah
ru: МашаАллах

# phrase_jazakallahu_khairan
source: JazakAllahu Khairan
ru: Джазакаллаху хайран

# phrase_barakallahu_feek
source: BarakAllahu Feek
ru: Баракаллаху фик

# phrase_ameen
source: Ameen
ru: Аминь

# phrase_la_hawla
source: La hawla wa la quwwata illa billah
ru: Ля хауля уа ля куввата илля биллях

# phrase_tawakkaltu
source: Tawakkaltu 'ala Allah
ru: Таваккальту аля Аллах

# phrase_rahimahu_allah
source: Rahimahu Allah
ru: Рахимаху Аллах

# phrase_fi_amanillah
source: Fi Amanillah
ru: Фи аманиллях

# phrase_taqabbal_allah
source: Taqabbal Allah
ru: ТакяббалАллах

# phrase_maa_salama
source: Ma'a Salama
ru: Маа саляма

# phrase_ya_allah
source: Ya Allah
ru: Я Аллах

# phrase_sallallahu_alayhi_wa_sallam
source: Peace and blessings of Allah be upon him
ru: Мир и благословение Аллаха да будут над ним

# phrase_alayhi_salam
source: Peace be upon him
ru: Мир да будет над ним

# phrase_radiyallahu_anhum
source: May Allah be pleased with them
ru: Пусть Аллах будет доволен ими

# phrase_subhanahu_wa_taala
source: Glory be to Him, the Exalted
ru: Пречист и Возвышен Он

source: OK
ru: ОК

source: Cancel
ar: إلغاء
kk: Болдырмау
ru: Отмена

source: Save
ar: حفظ
kk: Сақтау
ru: Сохранить

source: Done
ar: تم
kk: Дайын
ru: Готово

# keyboard_languages_title
source: Keyboard Languages
ar: لغات لوحة المفاتيح
kk: Пернетақта тілдері
ru: Языки клавиатуры

# keyboard_languages_subtitle
source: Choose which languages to show in the keyboard
ar: اختر اللغات التي تظهر في لوحة المفاتيح
kk: Пернетақтада көрсетілетін тілдерді таңдаңыз
ru: Выберите языки для отображения в клавиатуре

# keyboard_arabic_text_title
source: Arabic Text Language
ar: لغة النص العربي
kk: Араб мәтіні тілі
ru: Язык для арабского текста

# keyboard_arabic_text_subtitle
source: Choose which language should insert Arabic text
ar: اختر اللغة التي تدخل النص العربي
kk: Араб мәтінін енгізетін тілді таңдаңыз
ru: Выберите язык, который будет вставлять арабский текст

# keyboard_arabic_dua_text_title
source: Arabic Dua Language
ar: لغة الأدعية العربية
kk: Араб дұға тілі
ru: Язык для арабских дуа

# keyboard_arabic_dua_text_subtitle
source: Choose which language should insert Arabic duas (Arabic text only)
ar: اختر اللغة التي تدخل الأدعية العربية (النص العربي فقط)
kk: Араб дұғаларын енгізетін тілді таңдаңыз (тек араб мәтіні)
ru: Выберите язык, который будет вставлять арабские дуа (только арабский текст)

source: Save Selection
ar: حفظ الاختيار
kk: Таңдауды сақтау
ru: Сохранить выбор

# arabic_language_selection_title
source: Arabic Text Settings
ar: إعدادات النص العربي
kk: Араб мәтіні параметрлері
ru: Настройки арабского текста

# arabic_language_selection_subtitle
source: Choose which language should insert Arabic text instead of transliteration
ar: اختر اللغة التي تدخل النص العربي بدلاً من النقل الحرفي
kk: Транслитерация орнына араб мәтінін енгізетін тілді таңдаңыз
ru: Выберите язык, который будет вставлять арабский текст вместо транслитерации

# arabic_disabled
source: Disabled
ar: معطل
kk: Өшірілген
ru: Отключено

# arabic_disabled_description
source: All languages will insert transliteration
ar: جميع اللغات ستدخل النقل الحرفي
kk: Барлық тілдер транслитерация енгізеді
ru: Все языки будут вставлять транслитерацию

# arabic_english_description
source: English will insert Arabic text
ar: الإنجليزية ستدخل النص العربي
kk: Ағылшын тілі араб мәтінін енгізеді
ru: Английский будет вставлять арабский текст

# arabic_russian_description
source: Russian will insert Arabic text
ar: الروسية ستدخل النص العربي
kk: Орыс тілі араб мәтінін енгізеді
ru: Русский будет вставлять арабский текст

# arabic_kazakh_description
source: Kazakh will insert Arabic text
ar: الكازاخية ستدخل النص العربي
kk: Қазақ тілі араб мәтінін енгізеді
ru: Казахский будет вставлять арабский текст

# arabic_arabic_description
source: Arabic will insert Arabic text
ar: العربية ستدخل النص العربي
kk: Араб тілі араб мәтінін енгізеді
ru: Арабский будет вставлять арабский текст

# arabic_dua_language_selection_title
source: Arabic Dua Settings
ar: إعدادات الأدعية العربية
kk: Араб дұға параметрлері
ru: Настройки арабских дуа

# arabic_dua_language_selection_description
source: Choose which language should insert Arabic duas (Arabic text only)
ar: اختر اللغة التي تدخل الأدعية العربية (النص العربي فقط)
kk: Араб дұғаларын енгізетін тілді таңдаңыз (тек араб мәтіні)
ru: Выберите язык, который будет вставлять арабские дуа (только арабский текст)

# arabic_dua_disabled_description
source: All languages will insert translation only
ar: جميع اللغات ستدخل الترجمة فقط
kk: Барлық тілдер тек аударманы енгізеді
ru: Все языки будут вставлять только перевод

# arabic_dua_english_description
source: English will insert Arabic duas (Arabic text only)
ar: الإنجليزية ستدخل الأدعية العربية (النص العربي فقط)
kk: Ағылшын тілі араб дұғаларын енгізеді (тек араб мәтіні)
ru: Английский будет вставлять арабские дуа (только арабский текст)

# arabic_dua_russian_description
source: Russian will insert Arabic duas (Arabic text only)
ar: الروسية ستدخل الأدعية العربية (النص العربي فقط)
kk: Орыс тілі араб дұғаларын енгізеді (тек араб мәтіні)
ru: Русский будет вставлять арабские дуа (только арабский текст)

# arabic_dua_kazakh_description
source: Kazakh will insert Arabic duas (Arabic text only)
ar: الكازاخية ستدخل الأدعية العربية (النص العربي فقط)
kk: Қазақ тілі араб дұғаларын енгізеді (тек араб мәтіні)
ru: Казахский будет вставлять арабские дуа (только арабский текст)

# arabic_dua_arabic_description
source: Arabic will insert Arabic duas (Arabic text only)
ar: العربية ستدخل الأدعية العربية (النص العربي فقط)
kk: Араб тілі араб дұғаларын енгізеді (тек араб мәтіні)
ru: Арабский будет вставлять арабские дуа (только арабский текст)

# arabic_display_arabic
source: Arabic Text
ar: النص العربي
kk: Араб мәтіні
ru: Арабский текст

# arabic_display_english
source: English Translation
ar: الترجمة الإنجليزية
kk: Ағылшын аудармасы
ru: Английский перевод

# arabic_display_mode_title
source: Arabic Display Mode
ar: وضع عرض العربية
kk: Араб көрсету режимі
ru: Режим отображения арабского

# arabic_display_mode_subtitle
source: Choose how Arabic language displays content
ar: اختر كيف تعرض اللغة العربية المحتوى
kk: Араб тілі мазмұнды қалай көрсететінін таңдаңыз
ru: Выберите, как арабский язык отображает контент

# arabic_display_arabic_description
source: Show Arabic text and transliteration
ar: إظهار النص العربي والنقل الحرفي
kk: Араб мәтінін және транслитерацияны көрсету
ru: Показывать арабский текст и транслитерацию

# arabic_display_english_description
source: Show English translation instead of Arabic
ar: إظهار الترجمة الإنجليزية بدلاً من العربية
kk: Араб орнына ағылшын аудармасын көрсету
ru: Показывать английский перевод вместо арабского

source: Transliteration
ar: النقل الحرفي
kk: Транслитерация
ru: Транслитерация

source: Meaning
ar: المعنى
kk: Мағынасы
ru: Значение

source: When to Use
ar: متى تستخدم
kk: Қашан пайдалану
ru: Когда использовать

# keyboard_preview_title
source: Keyboard Preview
ar: معاينة لوحة المفاتيح
kk: Пернетақтаны алдын ала көру
ru: Предварительный просмотр клавиатуры

# keyboard_preview_description
source: See how the Muslim AI Keyboard works in real conversations. Tap on Islamic phrases to insert them into your messages.
ar: شاهد كيف تعمل لوحة المفاتيح الإسلامية الذكية في المحادثات الحقيقية. اضغط على العبارات الإسلامية لإدراجها في رسائلك.
kk: Мұсылман AI пернетақтасының нақты сөйлесулерде қалай жұмыс істейтінін көріңіз. Хабарларыңызға енгізу үшін ислами сөздерді басыңыз.
ru: Посмотрите, как работает клавиатура Muslim AI в реальных разговорах. Нажимайте на исламские фразы, чтобы вставить их в сообщения.

# short_duas_title
source: Short Duas
ar: الأدعية القصيرة
kk: Қысқа дұғалар
ru: Короткие дуа

# short_duas_subtitle
source: Quick prayers for daily communication
ar: أدعية سريعة للتواصل اليومي
kk: Күнделікті қарым-қатынас үшін жылдам дұғалар
ru: Быстрые молитвы для ежедневного общения

source: Search duas...
ar: البحث عن الأدعية...
kk: Дұғаларды іздеу...
ru: Поиск дуа...

# dua_arabic
source: ARABIC
ar: بالعربية
kk: АРАБ ТІЛІНДЕ
ru: АРАБСКИЙ

source: Translation
ar: الترجمة
kk: Аударма
ru: Перевод

# dua_translation
source: TRANSLATION
ar: الترجمة
kk: АУДАРМА
ru: ПЕРЕВОД

# dua_usage
source: USAGE
ar: الاستخدام
kk: ПАЙДАЛАНУ
ru: ИСПОЛЬЗОВАНИЕ

source: Copy Dua
ar: نسخ الدعاء
kk: Дұғаны көшіру
ru: Копировать дуа

source: Copy for Chat
ar: نسخ للدردشة
kk: Чатқа көшіру
ru: Копировать для чата

source: Add to Keyboard
ar: إضافة إلى لوحة المفاتيح
kk: Пернетақтаға қосу
ru: Добавить в клавиатуру

source: Remove from Keyboard
ar: إزالة من لوحة المفاتيح
kk: Пернетақтадан алу
ru: Убрать из клавиатуры

source: Home
ar: الرئيسية
kk: Басты
ru: Домой

# select_duas_subtitle
source: Choose which duas will appear in your keyboard
ar: اختر الأدعية للوحة المفاتيح
kk: Пернетақта үшін дұғаларды таңдаңыз
ru: Выберите, какие дуа будут отображаться в клавиатуре

# selected_count
source: Selected
ar: محدد
kk: Таңдалды
ru: Выбрано

# keyboard_colors_title
source: Keyboard Colors
ar: ألوان لوحة المفاتيح
kk: Пернетақта түстері
ru: Цвета клавиатуры

# keyboard_colors_subtitle
source: Choose your preferred color for keyboard buttons
ar: اختر لون لوحة المفاتيح
kk: Пернетақта түсін таңдаңыз
ru: Выберите предпочитаемый цвет для кнопок клавиатуры

# save_color_selection
source: Save Selection
ar: حفظ الاختيار
kk: Таңдауды сақтау
ru: Сохранить выбор

source: Color saved successfully!
ar: تم حفظ اللون بنجاح!
kk: Түс сәтті сақталды!
ru: Цвет успешно сохранён!

# color_islamic_green
source: Islamic Green
ar: الأخضر الإسلامي
kk: Ислами жасыл
ru: Исламский зелёный

# color_ocean_blue
source: Ocean Blue
ar: أزرق المحيط
kk: Мұхит көгі
ru: Океанский синий

# color_royal_purple
source: Royal Purple
ar: البنفسجي الملكي
kk: Патшалық күлгін
ru: Королевский фиолетовый

# color_golden_amber
source: Golden Amber
ar: العنبر الذهبي
kk: Алтын янтарь
ru: Золотой янтарь

# color_elegant_gray
source: Elegant Gray
ar: الرمادي الأنيق
kk: Сәнді сұр
ru: Элегантный серый

# color_pure_white
source: Pure White
ar: الأبيض النقي
kk: Таза ақ
ru: Чистый белый

# color_soft_pink
source: Soft Pink
ar: الوردي الناعم
kk: Жұмсақ қызғылт
ru: Нежный розовый

# color_deep_teal
source: Deep Teal
ar: الأزرق المخضر العميق
kk: Терең теңіз көгі
ru: Глубокий бирюзовый

# color_warm_orange
source: Warm Orange
ar: البرتقالي الدافئ
kk: Жылы сарғыш
ru: Тёплый оранжевый

# sticker_generator_title
source: Sticker Generator
ar: مولد الملصقات
kk: Стикер генераторы
ru: Генератор стикеров

# sticker_generator_subtitle
source: Intelligent Islamic sticker generation system with AI analysis
ar: نظام ذكي لتوليد الملصقات الإسلامية مع تحليل الذكاء الاصطناعي
kk: AI талдауымен ислами стикерлер жасаудың ақылды жүйесі
ru: Интеллектуальная система генерации исламских стикеров с AI-анализом

# sticker_content_type_title
source: Content Type
ar: نوع المحتوى
kk: Мазмұн түрі
ru: Тип контента

# sticker_type_textual
source: Textual
ar: نصي
kk: Мәтіндік
ru: Текстовый

# sticker_type_visual
source: Visual
ar: بصري
kk: Көрнекі
ru: Визуальный

# sticker_type_textual_desc
source: Islamic phrase calligraphy
ar: خط العبارات الإسلامية
kk: Ислами сөздердің каллиграфиясы
ru: Каллиграфия исламских фраз

# sticker_type_visual_desc
source: Illustrations and patterns
ar: الرسوم والأنماط
kk: Иллюстрациялар мен үлгілер
ru: Иллюстрации и узоры

# sticker_examples_title
source: Examples
ar: أمثلة
kk: Мысалдар
ru: Примеры

# sticker_input_title
source: Your phrase or description
ar: عبارتك أو وصفك
kk: Сіздің сөзіңіз немесе сипаттамаңыз
ru: Ваша фраза или описание

# sticker_input_placeholder
source: Enter text for sticker...
ar: أدخل عبارة إسلامية أو وصف...
kk: Ислами сөз немесе сипаттама енгізіңіз...
ru: Введите исламскую фразу или описание...

# sticker_input_limit
source: Maximum 200 characters
ar: الحد الأقصى 200 حرف
kk: Максимум 200 таңба
ru: Максимум 200 символов

# sticker_generate_button
source: 🎨 Generate Sticker
ar: 🎨 إنشاء ملصق
kk: 🎨 Стикер жасау
ru: Создать стикер

# sticker_generating_button
source: Generating...
ar: جاري الإنشاء...
kk: Жасалуда...
ru: Создание...

# sticker_generating_status
source: AI is analyzing your phrase and creating a unique sticker...
ar: الذكاء الاصطناعي يحلل عبارتك وينشئ ملصقاً فريداً...
kk: AI сіздің сөзіңізді талдап, бірегей стикер жасауда...
ru: AI анализирует вашу фразу и создает уникальный стикер...

# sticker_share_button
source: Share
ar: مشاركة
kk: Бөлісу
ru: Поделиться

# sticker_generation_success
source: Sticker created successfully!
ar: تم إنشاء الملصق بنجاح!
kk: Стикер сәтті жасалды!
ru: Стикер успешно создан!

# sticker_generation_time
source: Generation time:
ar: وقت التوليد:
kk: Жасау уақыты:
ru: Время генерации:

# sticker_generation_error
source: Error creating sticker. Please try again.
ar: خطأ في إنشاء الملصق. يرجى المحاولة مرة أخرى.
kk: Стикер жасауда қате. Қайта көріңіз.
ru: Ошибка при создании стикера. Попробуйте еще раз.

# sticker_analysis_title
source: AI Analysis
ar: تحليل الذكاء الاصطناعي
kk: AI Талдауы
ru: AI Анализ

# sticker_analysis_type
source: Type
ar: النوع
kk: Түрі
ru: Тип

# sticker_analysis_emotion
source: Emotion
ar: المشاعر
kk: Эмоция
ru: Эмоция

# sticker_analysis_style
source: Style
ar: الأسلوب
kk: Стилі
ru: Стиль

# sticker_analysis_colors
source: Colors
ar: الألوان
kk: Түстер
ru: Цвета

# sticker_preview_title
source: Preview
ar: معاينة
kk: Алдын ала қарау
ru: Предварительный просмотр

# sticker_preview_placeholder
source: Your sticker is ready!
ar: ملصقك جاهز!
kk: Сіздің стикеріңіз дайын!
ru: Ваш стикер готов!

# sticker_api_offline_note
source: API unavailable. Using demo mode.
ar: API غير متاح. استخدام الوضع التجريبي.
kk: API қолжетімсіз. Демо режимін пайдалану.
ru: API недоступен. Используется демо-режим.

# sticker_offline_mode
source: (Offline mode)
ar: (وضع عدم الاتصال)
kk: (Офлайн режимі)
ru: (Офлайн режим)

# sticker_progress_complete
source: Complete!
ar: مكتمل!
kk: Дайын!
ru: Готово!

# sticker_success_message
source: Alhamdulillah, your sticker is ready! 🎉
ru: Альхамдуллилях, ваш стикер готов! 🎉

# sticker_server_overloaded
source: Sorry, our servers are currently overloaded, please try again in 5 minutes. We are already working on this.
ar: عذراً، خوادمنا محملة بشكل زائد حالياً، يرجى المحاولة مرة أخرى خلال 5 دقائق. نحن نعمل على حل هذه المشكلة.
kk: Кешіріңіз, біздің серверлер қазір жүктелген, 5 минуттан кейін қайталап көріңіз. Біз бұл мәселемен жұмыс істеп жатырмыз.
ru: Извините, наши сервера сейчас перегружены, попробуйте через 5 минут. Мы уже работаем над этим.

# sticker_server_wait_time
source: ⏱️ Recommended wait time: 5 minutes
ar: ⏱️ وقت الانتظار الموصى به: 5 دقائق
kk: ⏱️ Ұсынылған күту уақыты: 5 минут
ru: ⏱️ Рекомендуемое время ожидания: 5 минут

# sticker_server_try_later
source: 🔄 Try again later
ar: 🔄 حاول مرة أخرى لاحقاً
kk: 🔄 Кейінірек қайталап көріңіз
ru: 🔄 Попробуйте снова позже

# sticker_retry_countdown
source: ⏱️ Retry in: %@
ar: ⏱️ إعادة المحاولة خلال: %@
kk: ⏱️ Қайталау: %@
ru: ⏱️ Повторная попытка через: %@

# sticker_offline_creating
source: Creating sticker in offline mode...
ru: Создание стикера в офлайн режиме...

# stickers_enabled_keyboard
source: Enable stickers in keyboard
ar: تفعيل الملصقات في لوحة المفاتيح
kk: Пернетақтада стикерлерді қосу
ru: Включить стикеры в клавиатуре
