Repository: Znbmels/keyboard
Catalog: Keyboard/*.lproj/Localizable.strings
Languages: ar, kk, ru

source: Create New Sticker
ar: إنشاء ملصق جديد
kk: Жаңа стикер жасау
ru: Создать новый стикер

source: Enter your text:
ar: أدخل النص الخاص بك:
kk: Мәтініңізді енгізіңіз:
ru: Введите ваш текст:

source: Content Type:
ar: نوع المحتوى:
kk: Мазмұн түрі:
ru: Тип контента:

source: Generate Sticker
ar: إنشاء ملصق
kk: Стикер жасау
ru: Создать стикер

source: Generating...
ar: جاري الإنشاء...
kk: Жасалуда...
ru: Создание...

source: Your Stickers
ar: ملصقاتك
kk: Сіздің стикерлеріңіз
ru: Ваши стикеры

source: Select for Keyboard
ar: اختيار للوحة المفاتيح
kk: Пернетақта үшін таңдау
ru: Выбрать для клавиатуры

# select_stickers_keyboard
source: Select stickers to show in keyboard
ar: اختر الملصقات لعرضها في لوحة المفاتيح
kk: Пернетақтада көрсету үшін стикерлерді таңдаңыз
ru: Выберите стикеры для отображения в клавиатуре

# sticker_library_title
source: Sticker Library
ar: مكتبة الملصقات
kk: Стикер кітапханасы
ru: Библиотека стикеров

# sticker_library_empty_title
source: No stickers yet
ar: لا توجد ملصقات بعد
kk: Әлі стикерлер жоқ
ru: Пока нет стикеров

# sticker_library_empty_subtitle
source: Create your first sticker in the generator
ar: أنشئ أول ملصق لك في المولد
kk: Генераторда алғашқы стикеріңізді жасаңыз
ru: Создайте свой первый стикер в генераторе

# sticker_library_create_first
source: Create Sticker
ar: إنشاء ملصق
kk: Стикер жасау
ru: Создать стикер

# sticker_library_delete_title
source: Delete sticker?
ar: حذف الملصق؟
kk: Стикерді жою керек пе?
ru: Удалить стикер?

# sticker_library_delete_message
source: This action cannot be undone
ar: لا يمكن التراجع عن هذا الإجراء
kk: Бұл әрекетті кері қайтару мүмкін емес
ru: Это действие нельзя отменить

# sticker_library_clear_all_title
source: Clear entire library?
ar: مسح المكتبة بالكامل؟
kk: Бүкіл кітапхананы тазалау керек пе?
ru: Очистить всю библиотеку?

# sticker_library_clear_all_message
source: All stickers will be deleted forever
ar: سيتم حذف جميع الملصقات إلى الأبد
kk: Барлық стикерлер мәңгілікке жойылады
ru: Все стикеры будут удалены навсегда

# sticker_library_clear_all
source: Clear All
ar: مسح الكل
kk: Барлығын тазалау
ru: Очистить все

# sticker_library_statistics
source: Statistics
ar: الإحصائيات
kk: Статистика
ru: Статистика

# sticker_detail_title
source: Sticker Details
ar: تفاصيل الملصق
kk: Стикер мәліметтері
ru: Детали стикера

# sticker_detail_prompt
source: Prompt
ar: الطلب
kk: Сұрау
ru: Промпт

# sticker_detail_type
source: Type
ar: النوع
kk: Түрі
ru: Тип

# sticker_detail_created
source: Created
ar: تم الإنشاء
kk: Жасалды
ru: Создан

# sticker_detail_style
source: Style
ar: الأسلوب
kk: Стилі
ru: Стиль

# sticker_detail_colors
source: Colors
ar: الألوان
kk: Түстер
ru: Цвета

source: Delete
ar: حذف
kk: Жою
ru: Удалить

# support_title
source: Support
ar: الدعم
kk: Қолдау
ru: Поддержка

# support_subtitle
source: I'm building Muslim AI Keyboard - because I want Muslims to communicate more comfortably in the chat.
ar: أنا أقوم ببناء لوحة مفاتيح المسلم الذكية - لأنني أريد أن يتواصل المسلمون بشكل أكثر راحة في الدردشة.
kk: Мен Muslim AI Keyboard жасап жатырмын - мұсылмандар чатта ыңғайлы қарым-қатынас жасасын деп.
ru: Я создаю Muslim AI Keyboard - потому что хочу, чтобы мусульмане общались комфортнее в чате.

# support_project_title
source: Support the Project:
ar: ادعم المشروع:
kk: Жобаны қолдаңыз:
ru: Поддержите проект:

# support_share_app
source: Share the App
ar: شارك التطبيق
kk: Қосымшаны бөлісу
ru: Поделиться приложением

# support_share_subtitle
source: Tell your friends about Muslim Keyboard
ar: أخبر أصدقاءك عن لوحة مفاتيح المسلم
kk: Достарыңызға Muslim Keyboard туралы айтыңыз
ru: Расскажите друзьям о Muslim Keyboard

# support_rate_app
source: Rate the App
ar: قيم التطبيق
kk: Қосымшаны бағалау
ru: Оценить приложение

# support_rate_subtitle
source: If you like it - give us a star
ar: إذا أعجبك - أعطنا نجمة
kk: Ұнаса - жұлдыз қойыңыз
ru: Если вам нравится - поставьте звезду

# support_social_title
source: Our Social Media:
ar: وسائل التواصل الاجتماعي:
kk: Біздің әлеуметтік желілер:
ru: Наши соцсети:

# support_email
source: Email
ar: البريد الإلكتروني
kk: Электрондық пошта
ru: Почта

# support_heart_title
source: A Small Request from the Heart:
ar: طلب صغير من القلب:
kk: Жүректен кішкентай өтініш:
ru: Небольшая просьба от сердца:

# support_heart_message
source: I'm creating something very simple, but needed by the Ummah. Your support is part of this journey. Make dua, tell others, give a like. Even one download is sadaka jariya, Insha'Allah.
ar: أنا أصنع شيئًا بسيطًا جدًا، لكنه مطلوب للأمة. دعمكم جزء من هذه الرحلة. ادعوا، أخبروا الآخرين، اعطوا إعجاب. حتى تحميل واحد هو صدقة جارية، إن شاء الله.
kk: Мен өте қарапайым, бірақ Үмметке қажет нәрсе жасап жатырмын. Сіздің қолдауыңыз - осы жолдың бір бөлігі. Дұға жасаңыз, басқаларға айтыңыз, лайк қойыңыз. Тіпті бір жүктеу де садақа жария, ИншаАллах.
ru: Я создаю что-то очень простое, но нужное Умме. Ваша поддержка - это часть этого пути. Сделайте дуа, расскажите другим, поставьте лайк. Даже одна загрузка - это садака джария, ИншаАллах.

# troubleshooting_title
source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها
kk: Ақаулықтарды жою
ru: Устранение неполадок

# keyboard_not_visible_title
source: Keyboard Not Visible in Settings
ar: لوحة المفاتيح غير مرئية في الإعدادات
kk: Пернетақта параметрлерде көрінбейді
ru: Клавиатура не видна в настройках

# keyboard_not_visible_description
source: If you can't find the keyboard in iOS Settings:
ar: إذا لم تتمكن من العثور على لوحة المفاتيح في إعدادات iOS:
kk: iOS параметрлерінде пернетақтаны таба алмасаңыз:
ru: Если вы не можете найти клавиатуру в настройках iOS:

# troubleshooting_step1
source: Make sure your device runs iOS 17.0 or later
ar: تأكد من أن جهازك يعمل بنظام iOS 17.0 أو أحدث
kk: Құрылғыда iOS 17.0 немесе жаңа нұсқа бар екенін тексеріңіз
ru: Убедитесь, что на устройстве iOS 17.0 или новее

# troubleshooting_step2
source: Go to Settings > General > Keyboard > Keyboards
ar: اذهب إلى الإعدادات > عام > لوحة المفاتيح > لوحات المفاتيح
kk: Параметрлер > Жалпы > Пернетақта > Пернетақталар бөліміне өтіңіз
ru: Перейдите в Настройки > Основные > Клавиатура > Клавиатуры

# troubleshooting_step3
source: Tap 'Add New Keyboard...'
ar: اضغط على 'إضافة لوحة مفاتيح جديدة...'
kk: 'Жаңа пернетақта қосу...' түймесін басыңыз
ru: Нажмите 'Добавить клавиатуру...'

# troubleshooting_step4
source: Look for 'Muslim AI Keyboard' in the list
ar: ابحث عن 'Muslim AI Keyboard' في القائمة
kk: Тізімнен 'Muslim AI Keyboard' іздеңіз
ru: Найдите 'Muslim AI Keyboard' в списке

# keyboard_not_working_title
source: Keyboard Not Working Properly
ar: لوحة المفاتيح لا تعمل بشكل صحيح
kk: Пернетақта дұрыс жұмыс істемейді
ru: Клавиатура работает неправильно

# keyboard_not_working_description
source: If the keyboard appears but doesn't work:
ar: إذا ظهرت لوحة المفاتيح ولكنها لا تعمل:
kk: Пернетақта пайда болады, бірақ жұмыс істемесе:
ru: Если клавиатура появляется, но не работает:

# troubleshooting_restart_step1
source: Restart your device completely
ar: أعد تشغيل جهازك بالكامل
kk: Құрылғыны толығымен қайта іске қосыңыз
ru: Полностью перезагрузите устройство

# troubleshooting_restart_step2
source: Remove and re-add the keyboard in Settings
ar: احذف وأعد إضافة لوحة المفاتيح في الإعدادات
kk: Параметрлерде пернетақтаны жойып, қайта қосыңыз
ru: Удалите и заново добавьте клавиатуру в настройках

# troubleshooting_restart_step3
source: Enable 'Allow Full Access' if needed
ar: فعّل 'السماح بالوصول الكامل' إذا لزم الأمر
kk: Қажет болса 'Толық қол жетімділікті рұқсат ету' опциясын қосыңыз
ru: Включите 'Разрешить полный доступ' при необходимости

# stickers_show_button_title
source: Show Stickers in Keyboard
ar: إظهار الملصقات في لوحة المفاتيح
kk: Стикерлерді көрсету
ru: Показать стикеры в клавиатуре

# stickers_show_button_subtitle
source: Enable stickers button in keyboard
ar: تفعيل زر الملصقات والوظائف في لوحة المفاتيح
kk: Пернетақтада стикерлер түймесін көрсету
ru: Включить кнопку стикеров в клавиатуре

source: Sticker Generator
ru: Генератор стикеров

# enter_sticker_text
source: Enter text for sticker...
ru: Введите текст для стикера...

source: Create Sticker
ru: Создать стикер

source: Sticker Library
ru: Библиотека стикеров

# sticker_timeout_error
source: This feature is still being developed. Thank you for your understanding!
ru: Данная функция еще не до конца готова, ведутся работы. Благодарим за понимание!

# sticker_network_error
source: Connection issues. Please try again later.
ru: Проблемы с подключением. Попробуйте позже.

# sticker_general_error
source: This feature is still being developed. Thank you for your understanding!
ru: Данная функция еще не до конца готова, ведутся работы. Благодарим за понимание!

source: Saved!
ru: Сохранено!

# sticker_read_instructions
source: Read Instructions Before Using
ru: Ознакомьтесь с инструкцией перед использованием

# sticker_instructions_title
source: Bismillah - Sticker Generator Guide
ru: Бисмилляh - Руководство по генератору стикеров

# sticker_instructions_nav_title
source: Instructions
ru: Инструкции

# sticker_what_can_generate
source: What You Can Generate:
ru: Что можно генерировать:

# sticker_can_islamic_phrases
source: Islamic phrases (Alhamdulillah, SubhanAllah, etc.)
ru: Исламские фразы (Альхамдулилляh, СубханАллаh и т.д.)

# sticker_can_duas
source: Beautiful duas and supplications
ru: Красивые дуа и мольбы

# sticker_can_quran_verses
source: Quranic verses in Arabic calligraphy
ru: Аяты Корана арабской каллиграфией

# sticker_can_islamic_art
source: Islamic geometric patterns and art
ru: Исламские геометрические узоры и искусство

# sticker_can_mosque_images
source: Mosque silhouettes and Islamic architecture
ru: Силуэты мечетей и исламская архитектура

# sticker_can_calligraphy
source: Arabic calligraphy designs
ru: Дизайны арабской каллиграфии

# sticker_what_cannot_generate
source: What You Cannot Generate:
ru: Что нельзя генерировать:

# sticker_cannot_people
source: Images of people or faces
ru: Изображения людей или лиц

# sticker_cannot_animals
source: Images of living creatures
ru: Изображения живых существ

# sticker_cannot_inappropriate
source: Inappropriate or offensive content
ru: Неподобающий или оскорбительный контент

# sticker_cannot_non_islamic
source: Non-Islamic religious content
ru: Неисламский религиозный контент

# sticker_prompt_examples
source: Example Prompts:
ru: Примеры запросов:

# sticker_example_alhamdulillah
source: 'Alhamdulillahi Rabbil Alameen' in golden calligraphy
ru: 'Альхамдулилляhи Раббиль Алямин' золотой каллиграфией

# sticker_example_bismillah
source: 'Bismillah' with green Islamic pattern
ru: 'Бисмилляh' с зеленым исламским узором

# sticker_example_mosque
source: Beautiful mosque silhouette at sunset
ru: Красивый силуэт мечети на закате

# sticker_example_ramadan
source: 'Ramadan Mubarak' with crescent moon
ru: 'Рамадан Мубарак' с полумесяцем

# sticker_example_eid
source: 'Eid Mubarak' with Islamic geometric design
ru: 'Ид Мубарак' с исламским геометрическим дизайном

# sticker_how_to_use
source: How to Use:
ru: Как использовать:

# sticker_step_1_write_prompt
source: Write your Islamic prompt in the text field
ru: Напишите ваш исламский запрос в текстовом поле

# sticker_step_2_wait_generation
source: Wait for generation (may take 20-30 seconds)
ru: Дождитесь генерации (может занять 20-30 секунд)

# sticker_step_3_select_stickers
source: Select stickers you want to use in keyboard
ru: Выберите стикеры для использования в клавиатуре

# sticker_step_4_use_in_keyboard
source: Open keyboard and tap sticker button (😊)
ru: Откройте клавиатуру и нажмите кнопку стикеров (😊)

# sticker_step_5_tap_to_copy
source: Tap on sticker to copy it to clipboard
ru: Нажмите на стикер, чтобы скопировать в буфер

# sticker_step_6_paste_in_chat
source: Paste in any chat app using Ctrl+V
ru: Вставьте в любой чат через Ctrl+V

# sticker_important_notes
source: Important Notes:
ru: Важные заметки:

# sticker_note_beta_feature
source: This feature is in development - expect occasional issues
ru: Функция в разработке - возможны сбои

# sticker_note_generation_time
source: Generation takes time - please be patient
ru: Генерация занимает время - будьте терпеливы

# sticker_note_contact_support
source: Contact developer if you experience problems
ru: Свяжитесь с разработчиком при проблемах

# sticker_note_disable_feature
source: You can disable stickers in Settings if needed
ru: Можно отключить стикеры в Настройках

# sticker_thanks_understanding
source: Jazakallahu Khairan for your understanding
ru: Джазакаллаhу хайран за понимание

# sticker_progress_creating
source: Creating image...
ar: إنشاء الصورة...
kk: Сурет жасау...
ru: Создание стикера...

# sticker_progress_processing
source: Processing result...
ar: معالجة النتيجة...
kk: Нәтижені өңдеу...
ru: Обработка...

# sticker_progress_connecting
source: Connecting to server...
ar: الاتصال بالخادم...
kk: Серверге қосылу...

# sticker_progress_sending
source: Sending generation request...
ar: إرسال طلب الإنشاء...
kk: Генерация сұрауын жіберу...

# sticker_progress_analyzing
source: Analyzing text...
ar: تحليل النص...
kk: Мәтінді талдау...

# sticker_progress_saving
source: Saving sticker...
ar: حفظ الملصق...
kk: Стикерді сақтау...

# sticker_progress_long_wait
source: Generation may take up to 10 minutes...
ar: قد يستغرق الإنشاء حتى 10 دقائق...
kk: Генерация 10 минутқа дейін уақыт алуы мүмкін...

# sticker_progress_unique_design
source: Creating unique design...
ar: إنشاء تصميم فريد...
kk: Бірегей дизайн жасау...
